def print_pack_report(number):
    """
    Печатает для каждого числа от number до 1 способ фасовки.
     Args:
        number (int): Целое положительное число больше 1 — максимальное
            количество пирожных для проверки.

    Returns:
        None: Функция ничего не возвращает, только печатает результат
        в консоль.
    """
    for i in range(number, 0, -1):
        if i % 3 == 0 and i % 5 == 0:
            print(i, "- расфасуем по 3 или по 5")
        elif i % 3 == 0:
            print(i, "- расфасуем по 3")
        elif i % 5 == 0:
            print(i, "- расфасуем по 5")
        else:
            print(i, "- не заказываем!")


print_pack_report(30)
